# 7 データのクリーニングと前処理

In [1]:
import pandas as pd
import numpy as np

## 7.1 欠損値の取り扱い

In [2]:
string_data=pd.Series(['aardvark','artichoke',np.nan,'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [3]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data[0]=None #Python組み込みの値Noneも欠損値として扱われる
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### 7.1.1 欠損値を削除する

In [5]:
from numpy import nan as NA

data=pd.Series([1,NA,3.5,NA,7])
data.dropna()   #欠損値でないデータとそのインデックスのみを持ったシリーズが返される

0    1.0
2    3.5
4    7.0
dtype: float64

In [6]:
data[data.notnull()]    #上記の方法と等価

0    1.0
2    3.5
4    7.0
dtype: float64

In [8]:
data=pd.DataFrame([[1.,6.5,3.],[1.,NA,NA],
                  [NA,NA,NA],[NA,6.5,3.]])
cleaned=data.dropna()   #デフォルトでは、欠損値を一つでも含む行をすべて削除する
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [9]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [10]:
data.dropna(how='all')  #すべてのデータが欠損値である行のみ削除

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [11]:
data[4]=NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [12]:
data.dropna(how='all',axis=1)   #列を削除する場合はaxis=1を指定する

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [13]:
df=pd.DataFrame(np.random.randn(7,3))
df.iloc[:4,1]=NA
df.iloc[:2,2]=NA
df

          0         1         2
0 -0.240938       NaN       NaN
1  1.137024       NaN       NaN
2 -0.989117       NaN  1.971093
3  0.104319       NaN  0.266425
4  1.278764  0.149132 -0.222256
5 -0.838226  0.308042 -0.365185
6  0.649782  0.193236  0.230955

In [14]:
df.dropna()

          0         1         2
4  1.278764  0.149132 -0.222256
5 -0.838226  0.308042 -0.365185
6  0.649782  0.193236  0.230955

In [15]:
df.dropna(thresh=2) #一定数（ここでは２個以上）欠損値が含まれている行を削除する

          0         1         2
2 -0.989117       NaN  1.971093
3  0.104319       NaN  0.266425
4  1.278764  0.149132 -0.222256
5 -0.838226  0.308042 -0.365185
6  0.649782  0.193236  0.230955

### 7.1.2 欠損値を穴埋めする

In [16]:
df.fillna(0)    #欠損値を0で埋める

          0         1         2
0 -0.240938  0.000000  0.000000
1  1.137024  0.000000  0.000000
2 -0.989117  0.000000  1.971093
3  0.104319  0.000000  0.266425
4  1.278764  0.149132 -0.222256
5 -0.838226  0.308042 -0.365185
6  0.649782  0.193236  0.230955

In [17]:
df.fillna({1:0.5,2:0})  #fillnaにディクショナリを与えると、列ごとに異なる値で埋めることができる

          0         1         2
0 -0.240938  0.500000  0.000000
1  1.137024  0.500000  0.000000
2 -0.989117  0.500000  1.971093
3  0.104319  0.500000  0.266425
4  1.278764  0.149132 -0.222256
5 -0.838226  0.308042 -0.365185
6  0.649782  0.193236  0.230955

In [18]:
#fillnaメソッドはデフォルトでは新しいオブジェクトを返すが、既存のオブジェクトを直接変更することもできる
_=df.fillna(0,inplace=True)
df

          0         1         2
0 -0.240938  0.000000  0.000000
1  1.137024  0.000000  0.000000
2 -0.989117  0.000000  1.971093
3  0.104319  0.000000  0.266425
4  1.278764  0.149132 -0.222256
5 -0.838226  0.308042 -0.365185
6  0.649782  0.193236  0.230955

In [20]:
df=pd.DataFrame(np.random.randn(6,3))
df.iloc[2:,1]=NA
df.iloc[4:,2]=NA
df

          0         1         2
0  1.871835  1.693625  0.677961
1  0.390682  0.562568  1.556127
2  1.108367       NaN  0.890575
3  0.895412       NaN  0.303892
4 -2.833381       NaN       NaN
5 -0.594838       NaN       NaN

In [21]:
df.fillna(method='ffill')   #再インデックス付のときと同じ穴埋め方法がfillnaメソッドでも使える

          0         1         2
0  1.871835  1.693625  0.677961
1  0.390682  0.562568  1.556127
2  1.108367  0.562568  0.890575
3  0.895412  0.562568  0.303892
4 -2.833381  0.562568  0.303892
5 -0.594838  0.562568  0.303892

In [22]:
df.fillna(method='ffill',limit=2)   #欠損値を二つまで埋める

          0         1         2
0  1.871835  1.693625  0.677961
1  0.390682  0.562568  1.556127
2  1.108367  0.562568  0.890575
3  0.895412  0.562568  0.303892
4 -2.833381       NaN  0.303892
5 -0.594838       NaN  0.303892

In [23]:
data=pd.Series([1.,NA,3.5,NA,7])
data.fillna(data.mean())    #欠損値をシリーズの平均で埋める

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## 7.2 データの変形

### 7.2.1 重複の除去

In [26]:
data=pd.DataFrame({'k1':['one','two']*3+['two'],
                   'k2':[1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [27]:
data.duplicated()   #データが重複しているか返す

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [28]:
data.drop_duplicates()  #duplucatedの結果がFalseの要素のみを持つデータを返す

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [29]:
data['v1']=range(7)
data.drop_duplicates(['k1'])    #'k1'列のみに基づいて重複を判定し、削除する

    k1  k2  v1
0  one   1   0
1  two   1   1